{
    "sectionTitle": "Технические навыки",
    "sectionSubtitle": "Подробный обзор моих технических навыков и опыта",
    "categories": {
        "frontend": {
            "name": "Фронтенд",
            "skills": [
                {
                    "name": "HTML, CSS, JavaScript",    
                    "code": "htmlcssjs",
                    "description": "Базовые веб-технологии, которые я освоил для создания адаптивных и интерактивных веб-приложений. Я создаю семантические HTML-структуры, использую современные CSS-макеты с Flexbox и Grid, и пишу чистый JavaScript-код.",
                    "experience": "Разработал множество сайтов и веб-приложений с адаптивным дизайном и кроссбраузерной совместимостью."
                },
                {
                    "name": "React",
                    "code": "react",
                    "description": "Создание сложных пользовательских интерфейсов с React, включая пользовательские хуки, контекст API и техники оптимизации производительности.",
                    "experience": "Разрабатывал и поддерживал масштабируемые приложения на React со сложным управлением состоянием и архитектурой компонентов."
                },
                {
                    "name": "Redux & Redux Toolkit",
                    "code": "redux",
                    "description": "Управление состоянием приложения с помощью Redux и Redux Toolkit, использование middleware, thunk и селекторов для эффективной работы с состоянием.",
                    "experience": "Интегрировал Redux в нескольких проектах, рефакторил устаревший код на Redux Toolkit и создавал переиспользуемые шаблоны управления состоянием."
                },
                {
                    "name": "Next.js",
                    "code": "nextjs",
                    "description": "Разработка серверно-рендеримых приложений на React с использованием Next.js, включая статическую генерацию и серверный рендеринг.",
                    "experience": "Создал продакшн-приложения на Next.js с оптимизированной производительностью, SEO и UX. Реализовал как App Router, так и Pages Router."
                },
                {
                    "name": "TypeScript",
                    "code": "typescript",
                    "description": "Написание типобезопасного кода с использованием TypeScript, создание пользовательских типов, интерфейсов и дженериков.",
                    "experience": "Перевёл проекты с JavaScript на TypeScript, создавал определения типов для внешних библиотек и реализовывал сложные шаблоны типизации."
                },
                {
                    "name": "Webpack",
                    "code": "webpack",
                    "description": "Настройка и оптимизация Webpack под нужды проекта, включая микрофронтенды и монорепозитории.",
                    "experience": "Настроил Webpack для архитектуры микрофронтендов, реализовал модульную федерацию и улучшил производительность сборки."
                },
                {
                    "name": "Turbopack & Turborepo",
                    "code": "turbopack",
                    "description": "Использование Turbopack для ускоренной сборки и Turborepo для управления монорепозиториями с несколькими пакетами и приложениями.",
                    "experience": "Интегрировал Turborepo в масштабные проекты для улучшения времени сборки и удобства разработки. Настроил кеширование и удалённую сборку."
                }
            ]
        },
        "backend": {
            "name": "Бэкенд",
            "skills": [
                {
                    "name": "Nest.js",
                    "code": "nestjs",
                    "description": "Разработка масштабируемых и поддерживаемых бэкенд-приложений с использованием Nest.js, его модульной архитектуры и системы внедрения зависимостей.",
                    "experience": "Реализовал REST API, GraphQL и микросервисы на Nest.js. Настроил авторизацию, аутентификацию и валидацию данных."
                },
                {
                    "name": "FastAPI",
                    "code": "fastapi",
                    "description": "Создание высокопроизводительных API с помощью FastAPI, включая автоматическую генерацию документации и валидацию типов.",
                    "experience": "Создавал production-API на FastAPI, применял асинхронные паттерны и интегрировал с различными базами данных и сервисами."
                },
                {
                    "name": "WebSockets",
                    "code": "websockets",
                    "description": "Реализация двусторонней связи в реальном времени между клиентом и сервером для чатов, уведомлений и лайв-обновлений.",
                    "experience": "Создавал системы чатов, панели в реальном времени и совместные редакторы с использованием WebSockets на фронте и бэке."
                },
                {
                    "name": "Очереди",
                    "code": "queues",
                    "description": "Использование очередей сообщений для асинхронной обработки, планирования задач и обмена данными в распределённых системах.",
                    "experience": "Интегрировал RabbitMQ, Redis и другие очереди для фоновой обработки, отправки писем и синхронизации между сервисами."
                },
                {
                    "name": "Проектирование REST API",
                    "code": "restapi",
                    "description": "Проектирование RESTful API с соблюдением лучших практик по маршрутам, статус-кодам и документации.",
                    "experience": "Создал подробную документацию API, реализовал стратегии версионирования и построил масштабируемую архитектуру API."
                }
            ]
        },
        "databases": {
            "name": "Базы данных",
            "skills": [
                {
                    "name": "Проектирование баз данных",
                    "code": "databases",
                    "description": "Проектирование схем, связей и стратегий оптимизации под различные приложения.",
                    "experience": "Проектировал базы данных для разных проектов, применял нормализацию, индексы и оптимизацию запросов."
                },
                {
                    "name": "MySQL",
                    "code": "mysql",
                    "description": "Работа с MySQL для хранения реляционных данных, написание сложных запросов, процедур и настройка производительности.",
                    "experience": "Внедрил MySQL в проде, проектировал эффективные схемы и оптимизировал производительность под высокую нагрузку."
                },
                {
                    "name": "PostgreSQL",
                    "code": "postgresql",
                    "description": "Использование расширенных возможностей PostgreSQL: JSON-хранение, полнотекстовый поиск и геоданные.",
                    "experience": "Работал с PostgreSQL в корпоративных проектах, использовал JSONB, массивы и сложные связи."
                },
                {
                    "name": "Firebase",
                    "code": "firebase",
                    "description": "Использование Firebase для realtime-баз, аутентификации, хранения и serverless-функций.",
                    "experience": "Интегрировал Firebase в веб- и мобильные приложения: синхронизация данных, авторизация, cloud functions."
                }
            ]
        },
        "devops": {
            "name": "DevOps",
            "skills": [
                {
                    "name": "CI/CD с GitHub Actions",
                    "code": "cicd",
                    "description": "Настройка CI/CD-пайплайнов через GitHub Actions: тестирование, сборка и деплой.",
                    "experience": "Разработал пайплайны CI/CD, автоматизировал сборку и деплой в разные окружения."
                },
                {
                    "name": "Linux",
                    "code": "linux",
                    "description": "Работа с Linux-серверами в dev/prod, написание bash-скриптов, настройка серверов.",
                    "experience": "Управлял серверами на Linux, автоматизировал задачи, настраивал Nginx, Apache."
                }
            ]
        },
        "architecture": {
            "name": "Архитектура",
            "skills": [
                {
                    "name": "Feature-Slice Design",
                    "code": "fsd",
                    "description": "Методология организации фронтенда по фичам, а не слоям — для масштабируемости и удобства команды.",
                    "experience": "Реализовал FSD в проектах на React и Next.js, повысил читаемость и модульность кода."
                },
                {
                    "name": "Onion/Модульная архитектура",
                    "code": "onion",
                    "description": "Архитектура backend-приложений с разделением на домен, приложение и инфраструктуру.",
                    "experience": "Реализовал Onion Architecture в NestJS, чётко разделив бизнес-логику и внешние зависимости."
                }
            ]
        },
        "ai": {
            "name": "ИИ",
            "skills": [
                {
                    "name": "Системы чатов",
                    "code": "chat",
                    "description": "Разработка чат-приложений в реальном времени с доставкой сообщений, индикаторами ввода и файлами.",
                    "experience": "Создал чаты для поддержки, группового общения и личных сообщений с realtime-интерфейсами."
                },
                {
                    "name": "ИИ-агенты с поиском",
                    "code": "rag",
                    "description": "Создание ИИ-ассистентов с поиском по базе знаний, использованием LLM и FastAPI.",
                    "experience": "Реализовал RAG-системы, подключил LLM, внедрил контекстно-зависимых ассистентов."
                }
            ]
        }
    }
}